from numpy.ma import count
l=[]

name_player_1 = input(" Введите name первого игрока, играющего крестами(x):")
l.append(name_player_1)
name_player_2 = input(" Введите name второго игрока, играющего 0:")
l.append(name_player_2)
print("     ")
print("     ")
print("     ")

print("     Добро пожаловать", ' и '.join(l),'!!!')
print("     ")

#Просто отобразим матрицей, что тут нужно делать
import numpy as np
Y = np.array([["", "0", "1", "2"],
              ["0", "-", "-", "-"],
              ["1", "-", "-", "-"],
              ["2", "-", "-", "-"]])
print("     Поле выглядит таким образом:")
for el in Y:
    print(*el)

print("     __________________________________")
print("     Правила игры:")
print("     Необходимо внести номер столбца, а затем строки для внесения вашего x или 0 в игровое поле")
print("     __________________________________")


#а такой визуализацией будем пользоваться
a = [[0]*3 for i in range(3)]
m=3
n=3
for i in range(m):
    for j in range(n):
       a[i][j]="-"


yesno = input("""   Введите Y, если хотите начать игру или любое другое значение, 
             если не хотите: """)

auth = yesno == "Y" or "y"

if auth == yesno:
    print("     Начинаем!!!")

    b =0 #создадим число повторений, если повторений более 8(m*n-1) и никто не выиграл-ничья
#тут мы в цикле будем выполнять заполнение x и 0 последовательно
    while b !=m*n:

        i_x = int(input("    Где отобразить x? Введите номер строки(от 0 до 2):"))
        while i_x >=3:
            print("!____Пожалуйста, введите цифру от 0 до 2")
            i_x = int(input("    Где отобразить x? Введите номер строки(от 0 до 2):"))

        j_x = int(input("    Теперь введите номер столбца:"))
        while j_x >= 3:
            print("!____Пожалуйста, введите цифру от 0 до 2")
            j_x = int(input("    Теперь введите номер столбца:"))


        while a[i_x][j_x] != "-":
                for el in a:
                    print(*el)
                print("!____Полe уже заполнено")
                i_x = int(input("   Где отобразить x? Введите номер строки(от 0 до 2):"))
                j_x = int(input("   Теперь введите номер столбца:"))
        a[i_x][j_x] = "x"


        for el in a:
            print(*el)


#далее условие выигрыша x
        if a[0][0] == a[1][1] == a[2][2] == "x"\
        or a[0][0] == a[0][1] == a[0][2] == "x"\
        or a[1][0] == a[1][1] == a[1][2] == "x"\
        or a[2][0] == a[2][1] == a[2][2] == "x"\
        or a[0][2] == a[1][1] == a[2][0] == "x"\
        or a[0][0] == a[1][0] == a[2][0] == "x"\
        or a[0][1] == a[1][1] == a[2][1] == "x"\
        or a[0][2] == a[1][2] == a[2][2] == "x":
            print("Игра закончена", name_player_1, "выиграл!")
            break

        b+=1
        if b == m*n:
            print("Ничья!")
            break


        i_0 = int(input("   Где отобразить 0? Введите номер строки(от 0 до 2):"))
        while i_0 >= 3:
            print("!____Пожалуйста, введите цифру от 0 до 2")
            i_0 = int(input("   Где отобразить 0? Введите номер строки(от 0 до 2):"))

        j_0 = int(input("   Теперь введите номер столбца:"))
        while j_0 >= 3:
            print("!____Пожалуйста, введите цифру от 0 до 2")
            j_0 = int(input("   Теперь введите номер столбца:"))


        while a[i_0][j_0] != "-":
                for el in a:
                    print(*el)
                print("!____Полe уже заполнено")
                i_0 = int(input("   Где отобразить 0? Введите номер строки(от 0 до 2):"))
                j_0 = int(input("   Теперь введите номер столбца:"))
        a[i_0][j_0] = "0"


        for el in a:
                print(*el)

        b+=1

#условия выигрыша 0 аналогично
        if a[0][0] == a[1][1] == a[2][2] == "0"\
        or a[0][0] == a[0][1] == a[0][2] == "0"\
        or a[1][0] == a[1][1] == a[1][2] == "0"\
        or a[2][0] == a[2][1] == a[2][2] == "0"\
        or a[0][2] == a[1][1] == a[2][0] == "0"\
        or a[0][0] == a[1][0] == a[2][0] == "0"\
        or a[0][1] == a[1][1] == a[2][1] == "0"\
        or a[0][2] == a[1][2] == a[2][2] == "0":
            print("Игра закончена", name_player_2, "выиграл!")
            break


    print("Спасибо за игру!")

else:
    print("До свидания!")
