name_player_1 = input("Введите name первого игрока, играющего крестами(x):")
name_player_2 = input("Введите name второго игрока, играющего 0:")
print("Добро пожаловать", name_player_1, "и", name_player_2, "!")

#Просто отобразим матрицей, что тут нужно делать
import numpy as np
Y = np.array([["", "0", "1", "2"],
              ["0", "-", "-", "-"],
              ["1", "-", "-", "-"],
              ["2", "-", "-", "-"]])
print("Поле выглядит таким образом:")
for el in Y:
    print(*el)

print("__________________________________")
print("Необходимо внести номер столбца, а затем строки для внесения вашего x или 0 в игровое поле")


#а такой визуализацией будем пользоваться
a = [[0]*3 for i in range(3)]
m=3
n=3
for i in range(m):
    for j in range(n):
       a[i][j]="-"
print("__________________________________")

yesno = input("""Введите Y, если хотите начать игру или N, 
             если не хотите: """)

auth = yesno == "Y" or "y"

if auth == yesno:
    print("Начинаем!!!")

#тут мы в цикле будем выполнять заполнение x и 0 последовательно
    while auth:

        i_x = int(input("Где отобразить x? Введите номер строки(от 0 до 2):"))
        while i_x > 3:
            print("Пожалуйста, введите цифру от 0 до 2")
            i_x = int(input("Где отобразить x? Введите номер строки(от 0 до 2):"))

        j_x = int(input("Теперь введите номер столбца:"))
        while j_x > 3:
            print("Пожалуйста, введите цифру от 0 до 2")
            j_x = int(input("Теперь введите номер столбца:"))


        while a[i_x][j_x] != "-":
                for el in a:
                    print(*el)
                print("_____Полe уже заполнено_____")
                i_x = int(input("Где отобразить x? Введите номер строки(от 0 до 2):"))
                j_x = int(input("Теперь введите номер столбца:"))
        a[i_x][j_x] = "x"


        for el in a:
            print(*el)

        n=0
        for el in a:
            if a[i][j] == a:
                n +=1

        if a[0][0] == a[1][1] == a[2][2] == "x"\
        or a[0][0] == a[0][1] == a[0][2] == "x"\
        or a[1][0] == a[1][1] == a[1][2] == "x"\
        or a[2][0] == a[2][1] == a[2][2] == "x"\
        or a[0][2] == a[1][1] == a[2][0] == "x"\
        or a[0][0] == a[1][0] == a[2][0] == "x"\
        or a[0][1] == a[1][1] == a[2][1] == "x"\
        or a[0][2] == a[1][2] == a[2][2] == "x":
            print("Игра закончена", name_player_1, "выиграл!")
            break


        i_0 = int(input("Где отобразить 0? Введите номер строки(от 0 до 2):"))
        while i_0 > 3:
            print("Пожалуйста, введите цифру от 0 до 2")
            i_0 = int(input("Где отобразить 0? Введите номер строки(от 0 до 2):"))

        j_0 = int(input("Теперь введите номер столбца:"))
        while j_0 > 3:
            print("Пожалуйста, введите цифру от 0 до 2")
            j_0 = int(input("Теперь введите номер столбца:"))


        while a[i_0][j_0] != "-":
                for el in a:
                    print(*el)
                print("_____Полe уже заполнено_____")
                i_0 = int(input("Где отобразить 0? Введите номер строки(от 0 до 2):"))
                j_0 = int(input("Теперь введите номер столбца:"))
        a[i_0][j_0] = "0"


        for el in a:
                print(*el)



        if a[0][0] == a[1][1] == a[2][2] == "0"\
        or a[0][0] == a[0][1] == a[0][2] == "0"\
        or a[1][0] == a[1][1] == a[1][2] == "0"\
        or a[2][0] == a[2][1] == a[2][2] == "0"\
        or a[0][2] == a[1][1] == a[2][0] == "0"\
        or a[0][0] == a[1][0] == a[2][0] == "0"\
        or a[0][1] == a[1][1] == a[2][1] == "0"\
        or a[0][2] == a[1][2] == a[2][2] == "0":
            print("Игра закончена", name_player_2, "выиграл!")
            break


    print("Спасибо за игру!")

else:
    print("До свидания!")
